[
  {
    "id": 123,
    "name": "Smartphone Samsung Galaxy S24 FE 128GB Grafite 5G 8GB RAM 6,7\" Câm. Tripla + Selfie 10MP",
    "description": "O Galaxy S24 FE Grafite 5G é o smartphone da Samsung para quem busca um aparelho com alta performance, design moderno e recursos avançados. Com tela Dynamic Amoled 2X de 6,7\", ele oferece uma experiência visual imersiva, além de contar com a câmera traseira tripla de 50MP (Wide) + 12MP (Ultra Wide) + 8MP (Telefoto) para registrar fotos e vídeos com qualidade profissional. A câmera frontal é de 10MP. É equipado com processador Samsung Exynos 2400e Deca-Core de 3.1GHz, que garante um desempenho fluido e sem travamentos, além de 8GB de memória RAM e 128GB de armazenamento interno. A bateria de 4700mAh com longa duração, permite usá-lo o dia todo sem se preocupar com a recarga. O aparelho possui proteção Corning Gorilla Victus, que garante maior resistência a quedas e arranhões. O acabamento é em alumínio. E ainda, oferece 7 Atualizações de Sistema Operacional e 7 anos de atualização de segurança, Galaxy AI (Inteligência Artificial) e Cadeado Galaxy. Atenção: Produto não acompanha fone de ouvido.",
    "price": 2498,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://a-static.mlcdn.com.br/800x560/smartphone-samsung-galaxy-s24-fe-128gb-grafite-5g-8gb-ram-67-cam-tripla-selfie-10mp/magazineluiza/240010800/cb7f1ca382009d6cca85a254ca69a9ae.jpg"
  },
  {
    "id": 134,
    "name": "Smartphone Samsung Galaxy A56 5G Preto 128GB, 8GB RAM, Câmera Tripla até 50MP, Tela Super AMOLED 6.7\", IP67, NFC, Vídeo HDR e Recursos AI",
    "description": "Apresentando o Galaxy A56 5G. Com espessura de 7,4mm e peso de 198g, o Galaxy A56 5G tem boa aderência. As câmeras aprimoradas são agrupadas para corresponder ao novo design linear. O Galaxy A56 5G tem quatro opções de cores: Grafite, Cinza, Verde e Rosa.",
    "price": 1834,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://imgs.casasbahia.com.br/55068951/1g.jpg"
  },
  {
    "id": 135,
    "name": "Smartphone Samsung Galaxy A25 6,5\" 256GB Azul Escuro 5G 8GB RAM Câm Tripla 50MP + Selfie 13MP Bateria 5000mAh Dual Chip",
    "description": "O Samsung Galaxy A25 na cor azul escuro é o smartphone que vai te acompanhar em todos os momentos. Com design moderno e infinita Super AMOLED de 6,5\", ele é perfeito para assistir filmes, jogar e navegar nas redes sociais. Para tirar ótimas fotos, a câmera traseira é tripla de 50MP com estabilização óptica + 8MP + 2MP que garantem fotos e vídeos de alta qualidade, enquanto a câmera frontal de 13MP, é ideal para selfies e videochamadas. Para guardar diversos arquivos, ele é equipado com 256GB de armazenamento interno e os 8GB de memória RAM, garante um desempenho rápido e eficiente, mesmo em multitarefas. Para acessar a internet de onde estiver, ele tem tecnologia 5G e é Dual Chip. Além disso, tem bateria de longa duração de 5000mAh para você ficar conectado o dia todo.",
    "price": 1349.1,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://a-static.mlcdn.com.br/800x560/smartphone-samsung-galaxy-a25-65-256gb-azul-escuro-5g-8gb-ram-cam-tripla-50mp-selfie-13mp-bateria-5000mah-dual-chip/magazineluiza/237215300/f506e35216a23119cb33d1f278f08c56.jpg"
  },
  {
    "id": 141,
    "name": "Smartphone Motorola Moto g55 5G Preto 256GB, 8GB RAM + 8GB RAM Boost, Câmera Traseira de até 50MP com AI, NFC e Tela 6.5\" com Superbrilho",
    "description": "Com a câmera principal de 50MP e estabilização óptica (OIS), o Moto G55 5G permite registrar fotos incríveis mesmo em movimento ou baixa iluminação. A lente ultrawide de 8 MP amplia o enquadramento, enquanto a câmera frontal de 16 MP garante selfies detalhadas e nítidas. Além disso, a inteligência artificial aprimora automaticamente cores e detalhes para resultados surpreendentes. A tela de 6,5 polegadas com tecnologia superbrilho proporciona imagens vibrantes e visibilidade impecável, mesmo sob luz solar intensa. Seu design resistente a respingos d'água oferece mais tranquilidade no uso diário, tornando a experiência ainda mais prática.",
    "price": 1266,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://imgs.casasbahia.com.br/55068804/1g.jpg"
  },
  {
    "id": 145,
    "name": "Smartphone Motorola Moto G15 - 128gb 12gb (4gb Ram+8gb Ram Boost) E Camera 50mp Com Ai E Night Vision Bateria De 5200 Mah Tela Fhd+ 6.7 Com Superbrilho Nfc Azul Escuro",
    "description": "A câmera de 50 MP do moto g15 com inteligência artificial, Night Vision automático e lente ultra-wide, captura fotos incríveis. A tela FHD+ de 6,7\" oferece o maior brilho da categoria¹, enquanto o desempenho é fluido com até 12 GB de RAM Boost Inteligente. Com o moto g15, você transforma fotos em histórias inesquecíveis.",
    "price": 679.15,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://http2.mlstatic.com/D_NQ_NP_605261-MLA82424784001_022025-O.webp"
  },
  {
    "id": 167,
    "name": "Xiaomi Redmi 14C Dual Sim Tela 6,88 Polegadas 4G 8GB RAM 256GB Câmera 50MP Smartphone Original",
    "description": "O Redmi 14C traz uma tela imersiva de 6,88\" com 120Hz, garantindo imagens fluidas e menos cansaço visual. Sua câmera de 50MP com IA captura fotos detalhadas. Com 256GB de armazenamento e 4+4GB de RAM virtual, oferece desempenho rápido. A bateria de 5160mAh garante até 2 dias de uso.",
    "price": 1051.9,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://down-br.img.susercontent.com/file/br-11134207-7r98o-m8gqcfm2kp3l8c@resize_w450_nl.webp"
  },
  {
    "id": 189,
    "name": "Xiaomi REDMI NOTE 14 256GB / 128GB Câmera dupla 108MP / 20mp 12GB RamBoost Tela AMOLED 120Hz FHD Design e Performance Premium Certificação PRO IP54 - Galter",
    "description": "O Note14 combina um design sofisticado com desempenho poderoso, ideal para quem busca velocidade, eficiência e qualidade fotográfica. Com uma câmera AI de 108MP, tela AMOLED de 120Hz e bateria de longa duração, este modelo entrega uma experiência premium para o dia a dia, garantindo fluidez em multitarefas, jogos e navegação.",
    "price": 1421.97,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://a-static.mlcdn.com.br/800x560/xiaomi-redmi-note-14-256gb-128gb-camera-dupla-108mp-20mp-12gb-ramboost-tela-amoled-120hz-fhd-design-e-performance-premium-certificacao-pro-ip54-galter/galtershop/celular-ateb-1-preto/911265580a6cbe60348ae2e6bd4777e5.jpeg"
  },
  {
    "id": 204,
    "name": "Smartphone Motorola Edge 50 Fusion 5G Blue Teal 256GB, 8GB RAM + 8GB Ram Boost, 50MP Sony AI Camera IP68 NFC",
    "description": "Com uma capacidade de 8GB RAM + 8GB Ram Boost e 256GB de armazenamento, o Celular Moto Edge 50 Fusion conta com a tecnologia RAM Boost, que permite a ampliação da memória RAM utilizando o espaço disponível no armazenamento interno, contribuindo para melhorar o desempenho do smartphone. Tudo isso, combinado com o processador Snapdragon garante ainda mais velocidade e eficiência em cada tarefa. Equipado com as lentes Sony LITIA™ 700C, o Celular Motorola Fusion proporciona imagens nítidas e vibrantes em qualquer cenário. E com a exclusiva borracha mágica do Google Fotos, você pode editar e aprimorar suas fotos de forma rápida e fácil. Desfrute de uma experiência de cinema onde quer que esteja, graças ao display expansivo de 6,7\" e à tecnologia Dolby Atmos®. Com imagens mais nítidas e som envolvente, transporte-se para o centro da ação.",
    "price": 1710,
    "category": "Celulares e Smartphones",
    "pictureUrl": "https://imgs.casasbahia.com.br/55066421/1g.jpg"
  }
]